import React from "react";
import Close from "public/images/icon/viewpointGuidClose.svg";
import styles from "./index.module.scss";
const ViewInstructionPage = ({ setOpenItem }) => {
  const closeHandler = () => {
    setOpenItem(null);
  };

  return (
    <div className={styles.viewInstructionPage}>
      <div className={styles.container}>
        <h3 className={styles.title}>雙龍七彩吊橋</h3>
        <div className={styles.borderBottom}></div>
        <p className={styles.content}>
          2020年開放的雙龍七彩吊橋，長342公尺、最深110公尺，是全台最長、最深的吊橋，跨越壯闊山谷，極具挑戰性，完善的環形步道與景觀平台，適合漫遊山林森呼吸，體驗原民部落之美。
          水源吊橋屬於輸送飲用水的水管專用，只有維修人員才可踏上禁地，一般人無緣接近。
          <br />
          2020年開放的雙龍七彩吊橋，長342公尺、最深110公尺，是全台最長、最深的吊橋，
          <br />
          跨越壯闊山谷，極具挑戰性，完善的環形步道與景觀平台，適合漫遊山林森呼吸，體驗原民部落之美。
          水源吊橋屬於輸送飲用水的水管專用，只有維修人員才可踏上禁地，一般人無緣接近。
          <br />
          跨越壯闊山谷，極具挑戰性，完善的環形步道與景觀平台，適合漫遊山林森呼吸，體驗原民部落之美。
          水源吊橋屬於輸送飲用水的水管專用，只有維修人員才可踏上禁地，一般人無緣接近。
          水源吊橋屬於輸送飲用水的水管專用，只有維修人員才可踏上禁地，一般人無緣接近。
          水源吊橋屬於輸送飲用水的水管專用，只有維修人員才可踏上禁地，一般人無緣接近。
          水源吊橋屬於輸送飲用水的水管專用，只有維修人員才可踏上禁地，一般人無緣接近。
          水源吊橋屬於輸送飲用水的水管專用，只有維修人員才可踏上禁地，一般人無緣接近。
          水源吊橋屬於輸送飲用水的水管專用，只有維修人員才可踏上禁地，一般人無緣接近。
          水源吊橋屬於輸送飲用水的水管專用，只有維修人員才可踏上禁地，一般人無緣接近。
          水源吊橋屬於輸送飲用水的水管專用，只有維修人員才可踏上禁地，一般人無緣接近。
          水源吊橋屬於輸送飲用水的水管專用，只有維修人員才可踏上禁地，一般人無緣接近。
          水源吊橋屬於輸送飲用水的水管專用，只有維修人員才可踏上禁地，一般人無緣接近。
          <br />
          跨越壯闊山谷，極具挑戰性，完善的環形步道與景觀平台，適合漫遊山林森呼吸，體驗原民部落之美。
          水源吊橋屬於輸送飲用水的水管專用，只有維修人員才可踏上禁地，一般人無緣接近。
          <br />
          跨越壯闊山谷，極具挑戰性，完善的環形步道與景觀平台，適合漫遊山林森呼吸，體驗原民部落之美。
          水源吊橋屬於輸送飲用水的水管專用，只有維修人員才可踏上禁地，一般人無緣接近。
          <br />
          跨越壯闊山谷，極具挑戰性，完善的環形步道與景觀平台，適合漫遊山林森呼吸，體驗原民部落之美。
          水源吊橋屬於輸送飲用水的水管專用，只有維修人員才可踏上禁地，一般人無緣接近。
          <br />
          跨越壯闊山谷，極具挑戰性，完善的環形步道與景觀平台，適合漫遊山林森呼吸，體驗原民部落之美。
          水源吊橋屬於輸送飲用水的水管專用，只有維修人員才可踏上禁地，一般人無緣接近。
          水源吊橋屬於輸送飲用水的水管專用，只有維修人員才可踏上禁地，一般人無緣接近。
          水源吊橋屬於輸送飲用水的水管專用，只有維修人員才可踏上禁地，一般人無緣接近。
          水源吊橋屬於輸送飲用水的水管專用，只有維修人員才可踏上禁地，一般人無緣接近。
          水源吊橋屬於輸送飲用水的水管專用，只有維修人員才可踏上禁地，一般人無緣接近。
          水源吊橋屬於輸送飲用水的水管專用，只有維修人員才可踏上禁地，一般人無緣接近。
        </p>
      </div>
      <div className={styles.close}>
        <img src={Close.src} alt='' onClick={closeHandler} />
      </div>
    </div>
  );
};

export default ViewInstructionPage;
